//=============================================================================
//
// タイトルの処理 [title.cpp]
// Author : Jukiya Hayakawa
//
//=============================================================================
#include "title.h"
#include "scene.h"
#include "scene2D.h"
#include "renderer.h"
#include "input.h"
#include "manager.h"
#include "debugproc.h"
#include "meshfield.h"
#include "fade.h"
#include "UI.h"

//=============================================================================
// 静的メンバ変数宣言
//=============================================================================


//=============================================================================
// タイトルのコンストラクタ
//=============================================================================
CTitle::CTitle()
{
}

//=============================================================================
// タイトルのデストラクタ
//=============================================================================
CTitle::~CTitle()
{

}

//=============================================================================
// タイトルのデストラクタ
//=============================================================================
CTitle *CTitle::Create()
{
	CTitle *pTitle = NULL;	//タイトルのポインタ

	if (pTitle == NULL)
	{
		pTitle = new CTitle;	//動的確保
		if (pTitle != NULL)
		{
			pTitle->Init();		//初期化処理
		}
	}
	return pTitle;
}

//=============================================================================
// タイトルの初期化処理
//=============================================================================
HRESULT CTitle::Init(void)
{

	CUI::Load();
	CUI::CreateMode(CManager::MODE_TITLE);


	//CMeshField::Create(D3DXVECTOR3(0.0f, 0.0f, 0.0f));

	return S_OK;
}

//=============================================================================
// タイトルの終了処理
//=============================================================================
void CTitle::Uninit(void)
{

	CUI::Unload();
	//全てのオブジェクト開放
	CScene::ReleaseAll();
}

//=============================================================================
// タイトルの更新処理
//=============================================================================
void CTitle::Update(void)
{
	//キーボードの取得
	CInputKeyboard *pInputKeyboard;
	pInputKeyboard = CManager::GetKeyboard();

	//ジョイパッドの取得
	CInputJoypad *pInputJoypad;
	pInputJoypad = CManager::GetJoypad();

	//フェードの取得
	CFade *pFade = CManager::GetFade();

	if (pInputKeyboard->GetTrigger(DIK_RETURN) == true ||
		pInputJoypad->GetTrigger(CInputJoypad::DIJS_BUTTON_A) == true)
	{//Enterキーを押下した場合
		//チュートリアルへ遷移
		pFade->SetFade(CManager::MODE_TUTORIAL, pFade->FADE_OUT);

	}

	//デバッグ表示
#ifdef _DEBUG
	CDebugProc::Print(1, "Title");
#endif
}

//=============================================================================
// タイトルの描画処理
//=============================================================================
void CTitle::Draw(void)
{

}