//=============================================================================
//
// デバック表示処理 [debufproc.h]
// Author :岸田怜(KishidaRei)
//=============================================================================
#ifndef _DEBUGPROC_H_
#define _DEBUGPROC_H_

#include "main.h"
//*****************************************************************************
//マクロ定義
//*****************************************************************************
//#define NUM_KEY_MAX (256)

//*****************************************************************************
// 入力のクラス構造体
//*****************************************************************************
class CDebugProc
{
public:
	CDebugProc();	//コンストラクタ
	~CDebugProc();	//デストラクタ
	void Init(void);	//初期化処理
	void Uninit(void);	//終了処理
	static void Print(char *fmt,...);//書き込み処理
	static void Draw(void);//描画処理

private:
	static LPD3DXFONT m_pFont;	//フォントのポインタ
	static char m_astr[1024];	//文字の格納用
};



#endif
