//=============================================================================
//
// マネージャ処理 [manager.cpp]
// Author :岸田怜(Kishida Rei)
//
//=============================================================================
#include "main.h"
#include "renderer.h"
#include "scene.h"
#include "scene2D.h"
#include "manager.h"
#include "input.h"
#include "title.h"
#include "fade.h"
#include "titlelogo.h"
#include "object.h"
#include "meshfield.h"
#include "inputx.h"
//****************************************************************************
// 静的メンバ変数
//*****************************************************************************
CTitleLogo *CTitle::m_pTitleLogo = NULL;
CObject *CTitle::m_pObject = NULL;				//オブジェクト
CMeshField *CTitle::m_pMeshField = NULL;			//メッシュフィールド


//=============================================================================
// 関数名：コンストラクタ
// 関数の概要：生成されたときに呼び出される。値のクリア
//=============================================================================
CTitle::CTitle()
{

}

//=============================================================================
// 関数名：デストラクタ
// 関数の概要：最後に呼び出される
//=============================================================================
CTitle::~CTitle()
{

}




//=============================================================================
// 関数名：タイトルの初期化処理
// 関数の概要：使用するテクスチャやモデルの読み込み
//=============================================================================
HRESULT CTitle::Init(void)
{
	//===============================================
	//テクスチャの読み込み
	//===============================================
	//タイトルロゴのテクスチャの読み込み
	m_pTitleLogo->Load();

	//配置するオブジェクトのテクスチャの読み込み
	m_pObject->Load();


	//===============================================
	// ゲーム内で使用する処理の生成
	//===============================================
	//メッシュフィールドの生成
	m_pMeshField = CMeshField::Create(D3DXVECTOR3(0.0f, 0.0f, 0.0f));


	//使用するオブジェクトモデルの読み込み・オブジェクト生成
	m_pObject->LoadModelText();





	//タイトルロゴの生成
	m_pTitleLogo->Create();

	return S_OK;

}
//=============================================================================
// 関数名：タイトルの終了処理
// 関数の概要：使用するテクスチャやモデルの破棄、シーンの破棄
//=============================================================================
void CTitle::Uninit()
{
		//シーンの破棄
		CScene::ReleaseSceneAll();

		//タイトルロゴのテクスチャの破棄
		m_pTitleLogo->Unload();


		//配置するオブジェクトのテクスチャの破棄
		//m_pObject->Unload();


}
//=============================================================================
// 関数名：タイトルの更新処理
// 関数の概要：--
//=============================================================================
void CTitle::Update()
{
	//フェードの取得
	CFade::FADE pFade;
	pFade = CFade::GetFade();


	//デバイスの取得
	CInputKeyboard *pInputKeyboard;
	pInputKeyboard = CManager::GetInputKeyboard();






}

//=============================================================================
// 関数名：タイトルの描画処理
// 関数の概要：--
//=============================================================================
void CTitle::Draw()
{


}
